In [1]:
    people = {
        "first": ["jay", "Jane","John"],
        "last" : ["murali","doe","doe"],
        "email": ["jaymurali@email.com","janedoe@email.com","johndoe@email.com"]
    }

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first    last                email
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = [x.upper() for x in df.columns]

In [7]:
df

  FIRST    LAST                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [14]:
df.rename(columns={'FIRST': 'name','LAST': 'surname'},inplace=True)
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [12]:
df.loc[2]

name                    John
surname                  doe
EMAIL      johndoe@email.com
Name: 2, dtype: object

In [17]:
df.loc[2]=['john','smith','johnsmith@email.com']

In [18]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john   smith  johnsmith@email.com